{
     "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
     "roleScopeTagIds": [
          "0"
     ],
     "deviceManagementApplicabilityRuleOsEdition": null,
     "deviceManagementApplicabilityRuleOsVersion": null,
     "deviceManagementApplicabilityRuleDeviceMode": null,
     "description": "",
     "displayName": "Updates Profile Win10 og 11",
     "deliveryOptimizationMode": "userDefined",
     "prereleaseFeatures": "userDefined",
     "automaticUpdateMode": "autoInstallAndRebootWithoutEndUserControl",
     "microsoftUpdateServiceAllowed": true,
     "driversExcluded": false,
     "installationSchedule": null,
     "qualityUpdatesDeferralPeriodInDays": 0,
     "featureUpdatesDeferralPeriodInDays": 0,
     "qualityUpdatesPaused": false,
     "featureUpdatesPaused": false,
     "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
     "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
     "businessReadyUpdatesOnly": "windowsInsiderBuildFast",
     "skipChecksBeforeRestart": false,
     "updateWeeks": null,
     "qualityUpdatesPauseStartDate": null,
     "featureUpdatesPauseStartDate": null,
     "featureUpdatesRollbackWindowInDays": 3,
     "qualityUpdatesWillBeRolledBack": null,
     "featureUpdatesWillBeRolledBack": null,
     "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
     "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
     "engagedRestartDeadlineInDays": null,
     "engagedRestartSnoozeScheduleInDays": null,
     "engagedRestartTransitionScheduleInDays": null,
     "deadlineForFeatureUpdatesInDays": 1,
     "deadlineForQualityUpdatesInDays": 1,
     "deadlineGracePeriodInDays": 1,
     "postponeRebootUntilAfterDeadline": false,
     "autoRestartNotificationDismissal": "notConfigured",
     "scheduleRestartWarningInHours": null,
     "scheduleImminentRestartWarningInMinutes": null,
     "userPauseAccess": "disabled",
     "userWindowsUpdateScanAccess": "disabled",
     "updateNotificationLevel": "disableAllNotifications",
     "allowWindows11Upgrade": true,
     "assignments": [
          {
               "source": "direct",
               "intent": "apply",
               "target": {
                    "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          },
          {
               "source": "direct",
               "intent": "apply",
               "target": {
                    "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}