{
     "templateId": null,
     "displayName": "Exchange Online Requires Compliant Device",
     "state": "disabled",
     "sessionControls": null,
     "conditions": {
          "userRiskLevels": [],
          "signInRiskLevels": [],
          "clientAppTypes": [
               "browser",
               "mobileAppsAndDesktopClients"
          ],
          "platforms": null,
          "locations": null,
          "times": null,
          "deviceStates": null,
          "devices": null,
          "clientApplications": null,
          "applications": {
               "includeApplications": [
                    "00000002-0000-0ff1-ce00-000000000000"
               ],
               "excludeApplications": [],
               "includeUserActions": [],
               "includeAuthenticationContextClassReferences": [],
               "applicationFilter": null
          },
          "users": {
               "includeUsers": [],
               "excludeUsers": [],
               "includeGroups": [
                    "e7c8de2a-19ca-48e0-a40c-2d64d4fc21ae"
               ],
               "excludeGroups": [],
               "includeRoles": [],
               "excludeRoles": [],
               "includeGuestsOrExternalUsers": null,
               "excludeGuestsOrExternalUsers": null
          }
     },
     "grantControls": {
          "operator": "OR",
          "builtInControls": [
               "compliantDevice"
          ],
          "customAuthenticationFactors": [],
          "termsOfUse": [],
          "authenticationStrength": null
     }
}