{
     "creationSource": null,
     "description": "",
     "name": "Firewall",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "0"
     ],
     "settingCount": 8,
     "technologies": "mdm,microsoftSense",
     "templateReference": {
          "templateId": "6078910e-d808-4a9f-a51d-1b8a7bacb7c0_1",
          "templateFamily": "endpointSecurityFirewall",
          "templateDisplayName": "Windows Firewall",
          "templateDisplayVersion": "Version 1"
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_audit_objectaccess_auditfilteringplatformconnection",
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "be9453a7-6348-4112-a49e-ad029d5d3548"
                    },
                    "choiceSettingValue": {
                         "value": "device_vendor_msft_policy_config_audit_objectaccess_auditfilteringplatformconnection_2",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "f5e48ffe-d924-4ee1-a1a1-677e259952fa",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_audit_objectaccess_auditfilteringplatformpacketdrop",
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "43f5366a-7e27-47a9-be51-d14189d02a17"
                    },
                    "choiceSettingValue": {
                         "value": "device_vendor_msft_policy_config_audit_objectaccess_auditfilteringplatformpacketdrop_2",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "bf48ef86-73e5-4a66-a693-24ff8e4be799",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "2",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_disablestatefulftp",
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "38329af6-2670-4a71-972d-482010ca97fc"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_global_disablestatefulftp_true",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "559f6e01-53a9-4c10-9f10-d09d8fe7f903",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "3",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_opportunisticallymatchauthsetperkm",
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "2b8d08ba-c8ac-41cb-995e-f4c42387b599"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_global_opportunisticallymatchauthsetperkm_false",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "606cd1ae-7b71-4ecf-a8d2-b6555b4c20cb",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "4",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_presharedkeyencoding",
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "a49fb169-715e-42ea-9916-35ac9de66f69"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_global_presharedkeyencoding_1",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "25ecf79d-adde-4cbd-948b-c1095058a6ee",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "5",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "7714c373-a19a-4b64-ba6d-2e9db04a7684"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_false",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "120c5dbe-0c88-46f0-b897-2c996d3e5277",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "6",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "1c14f914-69bb-49f8-af5b-e29173a6ee95"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_false",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "9d55dfae-d55f-4f2a-af03-9a9524f61e76",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "7",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "e2714734-708e-4286-8ae9-d56821e306a3"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_false",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "c38694c7-51a4-4a35-8f64-b10866a04776",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          },
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}